# MakeCutterForSectionGStepFailed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutterFailures..::..MakeCutterForSectionGStepFailed Property
BuiltInFailures..::..CutterFailures Class See Also
---
Attempt to create or manipulate a segmented section has failed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MakeCutterForSectionGStepFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MakeCutterForSectionGStepFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MakeCutterForSectionGStepFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CutterFailures Class
Autodesk.Revit.DB Namespace